Hi @Jamie-Leon ,

Thank you for your patience.
I wasn't able to reproduce the issue locally. I don't have the contents of the `thousandeyes-agent-ew-1` module to reproduce exactly what you did with the creation of the ThousandEyes agent in an EC2 instance, so I used a simple docker container. 

This is a very basic example that tries to emulate what you're doing, I think:

main.tf
```hcl
terraform {
  required_providers {
    thousandeyes = {
      source = "thousandeyes/thousandeyes"
      version = "~>2.0.1"
    }
  }
}

provider "thousandeyes" {
  token            = var.token
  account_group_id = var.account_group_id
}

module "thousandeyes-agent" {
  source = "./modules/agent"
}

module "thousandeyes-tests" {
  source = "./modules/tests"
  depends_on = [ module.thousandeyes-agent ]
}
```

`./modules/agent`:
```icl
terraform {
  required_providers {
    docker = {
      source = "kreuzwerker/docker"
      version = "~> 3.0.1"
    }
  }
}

resource "docker_image" "agent" {
  name         = "thousandeyes/enterprise-agent:latest"
  keep_locally = true
}

resource "docker_container" "agent" {
  image = docker_image.agent.image_id
  name  = "test-dynamic-agent"
  hostname = "test-dynamic-agent"
  memory = "2048"
  memory_swap = "4096"
  attach = false
  tty = true
  shm_size = 512
  env = ["TEAGENT_ACCOUNT_TOKEN=<token>", "TEAGENT_INET="]
  capabilities {
    add = ["NET_ADMIN", "SYS_ADMIN"]
  }
  command = ["/sbin/my_init"]
}
```

`./modules/tests`:
```hcl
terraform {
  required_providers {
    thousandeyes = {
      source = "thousandeyes/thousandeyes"
      version = "~>2.0.1"
    }
  }
}

resource "time_sleep" "wait_2m" {
  create_duration = "2m"
  triggers = {
    always_run = "${timestamp()}"
  }
}

data "thousandeyes_agent" "test-dynamic-agent" {
  agent_name = "test-dynamic-agent"

  depends_on = [ time_sleep.wait_2m ]
}

resource "thousandeyes_agent_to_server" "github-issue-138" {
  count                  = 1
  test_name              = "test github issue 138"
  interval               = 60
  alerts_enabled         = false
  use_public_bgp         = false
  bandwidth_measurements = true
  network_measurements   = true

  server = "www.thousandeyes.com"
  port   = 443

  agents {
    agent_id = data.thousandeyes_agent.test-dynamic.agent_id
  }
}
```

The docker container with agent is created first, it registers with ThousandEyes successfully while the 2 minute timer runs. After the timer finishes, the data resource reads the agent correctly and the test is created:
```
Terraform will perform the following actions:

  # module.thousandeyes-agent.docker_container.agent will be created
  + resource "docker_container" "agent" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = [
          + "/sbin/my_init",
        ]
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = [
          + "TEAGENT_ACCOUNT_TOKEN=<token>",
          + "TEAGENT_INET=",
        ]
      + exit_code                                   = (known after apply)
      + hostname                                    = "test-dynamic-agent"
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + memory                                      = 2048
      + memory_swap                                 = 4096
      + must_run                                    = true
      + name                                        = "test-dynamic-agent"
      + network_data                                = (known after apply)
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "no"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = 512
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = true
      + wait                                        = false
      + wait_timeout                                = 60

      + capabilities {
          + add  = [
              + "NET_ADMIN",
              + "SYS_ADMIN",
            ]
          + drop = []
        }
    }

  # module.thousandeyes-agent.docker_image.agent will be created
  + resource "docker_image" "agent" {
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = true
      + name         = "thousandeyes/enterprise-agent:latest"
      + repo_digest  = (known after apply)
    }

  # module.thousandeyes-tests.data.thousandeyes_agent.test-dynamic-agent will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "thousandeyes_agent" "test-dynamic-agent" {
      + agent_id   = (known after apply)
      + agent_name = "test-dynamic-agent"
      + agent_type = (known after apply)
      + id         = (known after apply)
    }

  # module.thousandeyes-tests.thousandeyes_agent_to_server.github-issue-138[0] will be created
  + resource "thousandeyes_agent_to_server" "github-issue-138" {
      + alerts_enabled         = false
      + api_links              = (known after apply)
      + bandwidth_measurements = true
      + created_by             = (known after apply)
      + created_date           = (known after apply)
      + enabled                = true
      + groups                 = (known after apply)
      + id                     = (known after apply)
      + interval               = 60
      + live_share             = (known after apply)
      + modified_by            = (known after apply)
      + modified_date          = (known after apply)
      + network_measurements   = true
      + path_trace_mode        = "classic"
      + port                   = 443
      + probe_mode             = "AUTO"
      + protocol               = "TCP"
      + saved_event            = (known after apply)
      + server                 = "www.thousandeyes.com"
      + test_id                = (known after apply)
      + test_name              = "test github issue 138"
      + type                   = (known after apply)
      + use_public_bgp         = false

      + agents {
          + agent_id     = (known after apply)
          + agent_type   = (known after apply)
          + ip_addresses = (known after apply)
        }
    }

  # module.thousandeyes-tests.time_sleep.wait_2m will be created
  + resource "time_sleep" "wait_2m" {
      + create_duration = "2m"
      + id              = (known after apply)
      + triggers        = {
          + "always_run" = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.thousandeyes-agent.docker_image.agent: Creating...
module.thousandeyes-agent.docker_image.agent: Creation complete after 0s [id=sha256:70eb238ec6a10487a4ad6c244607557ddd8bf91afdac5ce9d8d5cdabf64582dathousandeyes/enterprise-agent:latest]
module.thousandeyes-agent.docker_container.agent: Creating...
module.thousandeyes-agent.docker_container.agent: Creation complete after 0s [id=32d04ec73272a0aedf2ac25325665a68dd0568770992d3d67ad19043462e5ac7]
module.thousandeyes-tests.time_sleep.wait_2m: Creating...
module.thousandeyes-tests.time_sleep.wait_2m: Still creating... [10s elapsed]
module.thousandeyes-tests.time_sleep.wait_2m: Still creating... [20s elapsed]
module.thousandeyes-tests.time_sleep.wait_2m: Still creating... [30s elapsed]
module.thousandeyes-tests.time_sleep.wait_2m: Still creating... [40s elapsed]
module.thousandeyes-tests.time_sleep.wait_2m: Still creating... [50s elapsed]
module.thousandeyes-tests.time_sleep.wait_2m: Still creating... [1m0s elapsed]
module.thousandeyes-tests.time_sleep.wait_2m: Still creating... [1m10s elapsed]
module.thousandeyes-tests.time_sleep.wait_2m: Still creating... [1m20s elapsed]
module.thousandeyes-tests.time_sleep.wait_2m: Still creating... [1m30s elapsed]
module.thousandeyes-tests.time_sleep.wait_2m: Still creating... [1m40s elapsed]
module.thousandeyes-tests.time_sleep.wait_2m: Still creating... [1m50s elapsed]
module.thousandeyes-tests.time_sleep.wait_2m: Still creating... [2m0s elapsed]
module.thousandeyes-tests.time_sleep.wait_2m: Creation complete after 2m0s [id=2023-07-03T13:22:52Z]
module.thousandeyes-tests.data.thousandeyes_agent.test-dynamic-agent: Reading...
module.thousandeyes-tests.data.thousandeyes_agent.test-dynamic-agent: Read complete after 2s [id=0x14000115e00]
module.thousandeyes-tests.thousandeyes_agent_to_server.github-issue-138[0]: Creating...
module.thousandeyes-tests.thousandeyes_agent_to_server.github-issue-138[0]: Creation complete after 1s [id=3832827]
```

What are the terraform and provider versions that you're using? Also, can you write a simple end to end example that triggers the issue you're seeing and share it with us so that we may reproduce it?

Thank you,
Pedro